app/controllers/blogs_controller.rb

  def index
    @blogs =Blog.includes(:user).page(params[:page]).per(5).order("created_at DESC")
---
SELECT  `blogs`.* FROM `blogs` ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `blogs`

  def create
    @blog = Blog.create( title: blog_params[:title], image: blog_params[:image], content: blog_params[:content], user_id: current_user.id)
---
INSERT INTO `blogs` (`title`, `image`, `content`, `created_at`, `updated_at`, `user_id`) VALUES ('hahaha', '', 'hahaha', '2019-04-19 08:31:26', '2019-04-19 08:31:26', 1)

  def destroy
    @blog = Blog.find(params[:id])
    if @blog.user_id == current_user.id
      @blog.destroy
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 23 LIMIT 1
DELETE FROM `blogs` WHERE `blogs`.`id` = 23

  def edit
    @blog = Blog.find(params[:id])
---
SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 25 LIMIT 1