app/controllers/users_controller.rb

SELECT  `blogs`.* FROM `blogs` WHERE `blogs`.`user_id` = 1 ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `blogs` WHERE `blogs`.`user_id` = 1
---
  def show
    @nickname = current_user.nickname
    @blogs = current_user.blogs.page(params[:page]).per(5).order("created_at DESC")